app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "house_id", "img_url", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
  	house = House.all.sample.id
  	@student = Student.new(student_params)
  	@student.house_id = house
  	if @student.save